<?php

namespace Database\Seeders;

use App\Models\QuestionOptions;
use App\Repositories\QuestionRepository;
use Illuminate\Database\Seeder;

class QuestionSeeder extends Seeder
{
    /**
     * @var \App\Repositories\QuestionRepository
     */
    protected QuestionRepository $repository;

    public function __construct(QuestionRepository $repository)
    {
        $this->repository = $repository;
    }

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $questions = [
            [
                'order'        => 1,
                'section'      => 1,
                'badge'        => 'G-W1.1',
                'title'        => 'منبع اصلی آب مصرفی چیست؟',
                'descriptions' => '(توجه: برای مقاصد کلی ، از جمله آشامیدن، شستشو ، بهداشت ، نظافت محیط و لباسشویی ، (آب مصرفی برای اهداف پزشکی مانند دیالیز شامل نمی شود)) (پرکاربردترین را انتخاب کنید)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'سیستم لوله کشی (اگر بله ، سیستم توزیع را در   G-W1.2انتخاب کنید)',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'چاه لوله کشی شده',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'چاه بهسازی شده'
                    ],
                    [
                        'key'   => 4,
                        'value' => 'چاه بهسازی نشده '
                    ],
                    [
                        'key'   => 5,
                        'value' => 'چشمه بهسازی شده'
                    ],
                    [
                        'key'   => 6,
                        'value' => 'چشمه بهسازی نشده'
                    ],
                    [
                        'key'   => 7,
                        'value' => 'آب بازان'
                    ],
                    [
                        'key'   => 8,
                        'value' => 'کامیون نانکر'
                    ],
                    [
                        'key'   => 9,
                        'value' => 'آب سطحی (رودخانه/سد/دریاچه/حوضچه)'
                    ],
                    [
                        'key'   => 10,
                        'value' => 'قنات'
                    ],
                    [
                        'key'   => 11,
                        'value' => 'سایر'
                    ],
                    [
                        'key'   => 12,
                        'value' => 'اطلاعات در این زمینه وجود ندارد (به بخش G-S1 رجوع شود).'
                    ],
                    [
                        'key'   => 13,
                        'value' => 'هیچ منبع آبی وجود ندارد  یا بیماران آب را از خانه می آورند (به بخش G-S1 رجوع شود).'
                    ],
                ],
            ],
            [
                'order'        => 2,
                'section'      => 1,
                'badge'        => 'G-W2.1',
                'title'        => 'سیستم اصلی توزیع آب برای تأسیسات چیست؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'سیستم توزیع آب عمومی در داخل ساختمان (اگر بله ، به بخش G-W3 رجوع شود)',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'سیستم توزیع آب عمومی در خارج از ساختمان',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'سیستم توزیع غیر عمومی آب در داخل ساختمان( اگر بله ، به بخش G-W3  رجوع شود).',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سیستم توزیع غیر عمومی آب در خارج از ساختمان',
                    ],
                ],
            ],
            [
                'order'        => 3,
                'section'      => 1,
                'badge'        => 'G-W2',
                'title'        => 'منبع اصلی تامین آب کجا قرار دارد؟',
                'descriptions' => '(توجه: فاصله مرکز بهداشتی تا نقطه برداشت آب (به عنوان مثال فاصله تا شیر آب ، چاه و...)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'در محل (در داخل ساختمان یا محوطه تاسیسات)',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'تا 500 متر',
                    ],
                    [
                        'key'   => 3,
                        'value' => '500 متر یا بیشتر',
                    ],
                ],
            ],
            [
                'order'        => 4,
                'section'      => 1,
                'badge'        => 'G-W3',
                'title'        => 'آیا در زمان تکمیل پرسشنامه، دسترسی به منبع اصلی آب موجود و کافی است؟',
                'descriptions' => '(توجه: پرسشگر باید خود مشاهد و تأیید کند که دسترسی به منبع آب وجود دارد، به عنوان مثال ، بررسی کنید که شیرها یا پمپ های دستی آب به خوبی کار می کنند.)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 5,
                'section'      => 1,
                'badge'        => 'G-W4',
                'title'        => 'منبع تأمین آب ثانویه/تکمیلی تأسیسات بهداشتی چیست؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'لوله کشی متصل به سیستم توزیع آب عمومی / غیر عمومی داخل ساختمان',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'لوله کشی متصل به سیستم توزیع آب عمومی / غیر عمومی آب در خارج از ساختمان',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'چاه لوله کشی شده',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'چاه بهسازی شده',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'چاه بهسازی نشده',
                    ],
                    [
                        'key'   => 6,
                        'value' => 'چشمه بهسازی شده',
                    ],
                    [
                        'key'   => 7,
                        'value' => 'چشمه بهسازی نشده',
                    ],
                    [
                        'key'   => 8,
                        'value' => 'آب باران',
                    ],
                    [
                        'key'   => 9,
                        'value' => 'کامیون تانکردار',
                    ],
                    [
                        'key'   => 10,
                        'value' => 'آب سطحی (رودخانه/سد/دریاچه/حوضچه)',
                    ],
                    [
                        'key'   => 11,
                        'value' => 'قنات',
                    ],
                    [
                        'key'   => 12,
                        'value' => 'سایر منابع',
                    ],
                    [
                        'key'   => 13,
                        'value' => 'هیچ منبع آبی وجود ندارد  یا بیماران آب را از خانه می آورند',
                    ],
                ],
            ],
            [
                'order'        => 6,
                'section'      => 1,
                'badge'        => 'G-W5',
                'title'        => 'آیا تانک/ مخزن ذخیره آب برای رفع نیازهای آبی در طول کمبود یا قطعی آب حداقل تا به مدت 2 روز وجود دارد؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 7,
                'section'      => 1,
                'badge'        => 'G-W6',
                'title'        => 'در مجموع ، آیا منابع آب برای تامین نیازهای عمومی کافی می باشد؟',
                'descriptions' => '(توجه: برای تهیه غذا ، توالت ، شست و شوی دست ، حمام کردن در مواقع بستری و خشکشویی)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 8,
                'section'      => 1,
                'badge'        => 'G-W7',
                'title'        => 'آیا حداقل یک ایستگاه آب آشامیدنی قابل اعتماد برای کارکنان ، بیماران و مراقبین قابل دسترسی می باشد؟',
                'descriptions' => '(توجه: ایستگاه آب آشامیدنی باید توسط پرسشگر مشاهده شود)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 9,
                'section'      => 1,
                'badge'        => 'G-W8',
                'title'        => 'آیا FRC (غلظت کلر باقیمانده) به صورت روزانه اندازه گیری می شود؟ ',
                'descriptions' => '(توجه: سوابق آنالیز کیفیت آب آشامیدنی باید توسط پرسشگر بررسی شود.)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 10,
                'section'      => 1,
                'badge'        => 'G-W8.1',
                'title'        => 'اگر به سوال G-W8 پاسخ مثبت داده اید ، آیا اندازه گیری FRC  (غلظت کلر باقیمانده) مطابق با دستورالعمل های آب آشامیدنی WHO  انجام می شود؟ ',
                'descriptions' => '(توجه: FRC≥ 0.2 میلی گرم در لیتر)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'سایر',
                    ],
                ],
            ],
            [
                'order'        => 11,
                'section'      => 1,
                'badge'        => 'G-W9',
                'title'        => 'آیا تست کلیفرم کل/مدفوع به صورت هفتگی انجام می شود؟',
                'descriptions' => '(توجه: سوابق آنالیز کیفیت آب آشامیدنی باید توسط پرسشگر بررسی شود.)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'بله ، اما نه به صورت هفتگی',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'نه',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سایر',
                    ],
                ],
            ],
            [
                'order'        => 12,
                'section'      => 1,
                'badge'        => 'G-W9.1',
                'title'        => 'اگر G-W9 پاسخ مثبت داده اید ، آیا تست کلیفرم کل/مدفوعی مطابق با دستورالعمل های آب آشامیدنی WHO انجام می شود؟',
                'descriptions' => ' (توجه: باکتری های کلیفرم = صفر کلیفرم در 100 میلی لیتر آب)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'سایر',
                    ],
                ],
            ],
            [
                'order'        => 1,
                'section'      => 2,
                'badge'        => 'G-S1',
                'title'        => 'چه نوع توالت/دستشویی در این مرکز برای بیماران وجود دارد؟',
                'descriptions' => '(توجه: در صورت استفاده از بیش از یک نوع توالت ، رایج ترین نوع توالت فرنگی/سرویس بهداشتی در منطقه سرویس باید انتخاب شود)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'توالت فرنگی / دفع فاضلاب به سیستم فاضلاب متصل به تصفیه خانه فاضلاب بیمارستانی',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'توالت فرنگی / دفع فاضلاب به سیستم فاضلاب متصل به تصفیه خانه فاضلاب شهری',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'توالت فرنگی / دفع فاضلاب در تانک یا چاه',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سرویس بهداشتی دارای چاه',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'سرویس بهداشتی دارای سیستم کمپوست',
                    ],
                    [
                        'key'   => 6,
                        'value' => 'توالت فرنگی / دفع فاضلاب در سیستم زهکی رو باز',
                    ],
                    [
                        'key'   => 7,
                        'value' => 'سرویس بهداشتی دارای چاه',
                    ],
                    [
                        'key'   => 8,
                        'value' => 'سطل',
                    ],
                    [
                        'key'   => 9,
                        'value' => 'توالت فرنگی/دستشویی دیواری',
                    ],
                    [
                        'key'   => 10,
                        'value' => 'بدون توالت/دستشویی (به بخش G-H1 رجوع شود)',
                    ],
                    [
                        'key'   => 11,
                        'value' => 'سایر',
                    ],
                ],
            ],
            [
                'order'        => 2,
                'section'      => 2,
                'badge'        => 'G-S2',
                'title'        => 'آیا حداقل یک توالت در زمان نظرسنجی (در دسترس ، کاربردی و خصوصی) قابل استفاده است؟',
                'descriptions' => '(توجه: در دسترس : توالت در محل ،  دارای درب  مجهز به قفل و کلید همیشه در دسترس است.
کاربردی: مجرای دفع فاضلاب مسدود نشده است ، آب برای توالت های دارای سیفون همیشه در دسترس است و هیچ شکاف یا نشتی در ساختار توالت وجود ندارد
خصوصی: اتاقک توالت دارای یک در است که از داخل قفل می شود و هیچ شکاف یا سوراخ بزرگی در ساختار نیست.
** اگر هریک از این معیارها برآورده نشده باشد ، سرویس بهداشتی/دستشویی قابل استفاده محسوب نمی شود)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 3,
                'section'      => 2,
                'badge'        => 'G-S3',
                'title'        => 'آیا حداقل یک توالت (در دسترس ، کاربردی ، خصوصی) وجود دارد که منحصراً به کارکنان اختصاص داده شود؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 4,
                'section'      => 2,
                'badge'        => 'G-S4',
                'title'        => 'آیا حداقل یک توالت مجزا برای هر گروه جنسی (تفکیک جنسیتی) وجود دارد؟ ',
                'descriptions' => '(توجه: توالت ها می توانند در اتاقی با چند غرفه یا در یک اتاق خصوصی با یک توالت واحد باشند. توالت در اتاق هایی با چند غرفه باید برای استفاده زنان یا مردان اختصاصی  در نظر گرفته شوند تا به زنان و مردان اجازه دهد از توالت جداگانه استفاده کنند)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 5,
                'section'      => 2,
                'badge'        => 'G-S5',
                'title'        => 'آیا حداقل یک توالت فرنگی دارای امکانات بهداشتی دوره قاعدگی می باشد؟',
                'descriptions' => '(توجه: دارای سطل زباله درب دار برای دور ریختن محصولات بهداشتی قاعدگی استفاده شده و آب و صابون در فضای مجزا برای شستشو موجود باشد)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 6,
                'section'      => 2,
                'badge'        => 'G-S6',
                'title'        => 'آیا حداقل یک توالت فرنگی وجود دارد که برای افراد دارای معلولیت جسمی قابل استفاده باشد؟',
                'descriptions' => '(توجه: پرسشگر باید شرایط زیر را مدنظر قرار دهد: می توان بدون پله به آن دسترسی داشت، نرده های نگهدارنده به کف یا دیوارهای کناری متصل شده اند، عرض درب حداقل 80 سانتی متر است و دستگیره در و صندلی در دسترس افرادی که از ویلچر یا عصا استفاده می کنند، می باشد)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 1,
                'section'      => 3,
                'badge'        => 'G-S7',
                'title'        => 'آیا تا به حال چاه یا سپتیک تانک تخلیه شده است؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر (به بخش G-H1 رجوع شود)',
                    ],
                ],
            ],
            [
                'order'        => 2,
                'section'      => 3,
                'badge'        => 'G-S8',
                'title'        => 'نحوه دفع فاضلاب چگونه است؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'سیستم تصفیه داخلی',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'مدفون در گودالی سرپوشیده در محل',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'خارج از محوطه دفع می شود',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'اطلاعاتی وجود ندارد',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'سایر',
                    ],
                ],
            ],
            [
                'order'        => 1,
                'section'      => 4,
                'badge'        => 'G-H1',
                'title'        => 'آیا تسهیلات بهداشتی کاربردی شست و شوی دست در نقاط مناسب ارائه خدماتی و مراقبت های بهداشتی وجود دارد؟ ',
                'descriptions' => '(توجه: کاربردی: دارای صابون و آب با یک لگن برای شستن دستها یا ضدعفونی با الکل (همانطور که در اینجا ذکر شد ، به نظر می رسد که استفاده از آب و صابون را می توان با یک ضدعفونی کننده (به عنوان مثال الکل) جایگزین کرد در حالی که آنها دارای دو عملکرد متفاوت بوده و باید به طور متوالی مورد استفاده قرار گیرد (اول شستن دست با آب و صابون ، دوم استفاده از ضد عفونی کننده های دست)
 ارائه خدمات و مراقبت های بهداشتی: هر مکانی در)HFC  مراکز مراقبت های بهداشتی و درمان) که مراقبت یا درمان در آن انجام می شود (به عنوان مثال ، اتاق مشاوره)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله (صابون و آب + ضدعفونی کننده دست)',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'بله (صابون و مقدار زیادی آب سالم)',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'خیر ، امکانات بهداشتی دست در نقاط مراقبت های بهداشتی وجود دارد اما کاربرد ندارند ، یا فاقد آب و صابون یا ضدعفونی کننده دست الکلی است.',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'خیر ، هیچگونه امکانات بهداشتی دست در محل های مراقبت وجود ندارد.',
                    ],
                ],
            ],
            [
                'order'        => 2,
                'section'      => 4,
                'badge'        => 'G-H2',
                'title'        => 'آیا حداقل یک سرویس شستشوی دست برای هر یک یا چند سرویس بهداشتی در مرکز موجود می باشد؟ ',
                'descriptions' => '(توجه: امکانات شستشوی دستی در توالت ها باید شامل آب و صابون باشد ، نه ضدعفونی کننده های الکلی به تنهایی ، زیرا ضدعفونی کننده های الکلی مواد مدفوع را پاک نمی کند. اگر حداقل یک توالت دارای امکان شستشو با آب و صابون در فاصله 5 متری است ، گزینه بله را انتخاب نمایید)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'خیر ',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر ، امکانات شستشوی دست در نزدیکی توالت ها وجود دارد اما فاقد آب و/یا صابون است',
                    ],
                    [
                        'key'   => 3,
                        'value' => ' خیر ، امکانات شستشوی دست در نزدیکی توالت ها وجود ندارد (در فاصله 5 متری)',
                    ],
                ],
            ],
            [
                'order'        => 3,
                'section'      => 4,
                'badge'        => 'G-H3',
                'title'        => 'آیا دستوالعمل های نحوه صحیح بهداشت و شست و شوی دست (پوستر) در نزدیکی ایستگاه های شست و شوی دست و/یا محل انتظار بیماران نمایش داده شده است؟ ',
                'descriptions' => '(توجه: پرسشگر باید در صورتی که مطالبی روی دیوار نصب شده باشد، آن را مشاهده نماید)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 4,
                'section'      => 4,
                'badge'        => 'G-H4',
                'title'        => 'آیا یک روش مشخص و کار برای کنترل و پر کردن مجدد لوازم شستشوی دست وجود دارد؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'بله ، تأسیس شده اما کار نمی کند',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 1,
                'section'      => 5,
                'badge'        => 'G-WM1',
                'title'        => 'آیا سیستم تفیک پسماند به درستی در محل انجام می شود؟ (حداقل سیستم تفکیک سه سطلی) ',
                'descriptions' => 'یادداشت:
یک اتاق مراقبت های بهداشتی درمانی را به طور تصادفی انتخاب کنید و مشاهده کنید که آیا زباله های تیز و برنده (Safety Box) ، زباله های عفونی (سطل زرد) و مواد زائد شیمیایی-دارویی (سطل سفید) و سایر زباله ها (سطل های آبی) به چهار سطل مختلف تفکیک شده اند یا خیر.
موارد مورد نیاز برای سطل زباله:
•	سطل ها باید دارای کد رنگی و/یا برچسب واضح باشند
•	بیش از سه چهارم (75٪) از حجم آنها پر نشوند
•	هر سطل نباید حاوی ضایعات دیگری باشد که مربوط به برچسب آن نیست.
•	 سطل زباله باید متناسب با نوع زباله ای باشد که در آن قرار دارد. ظروف  نگهداری زباله های تیز باید مستحکم باشند و بقیه باید ضد نشت باشند. سطل های زباله های تیز و زباله های عفونی باید دارای درپوش باشند.
',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله ، زباله ها در چهار سطل زباله برچسب دار تفکیک می شوند.',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر ، سطل های زباله وجود دارد اما همه شرایط را برآورده نمی کنند یا زباله ها به درستی تفکیک نشده اند.',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'خیر ، سطل های تفکیک زباله وجود ندارند',
                    ],
                ],
            ],
            [
                'order'        => 2,
                'section'      => 5,
                'badge'        => 'G-WM2',
                'title'        => 'این مرکز معمولاً چگونه زباله های عفونی را دفع می کند؟ ',
                'descriptions' => 'توجه: روشی که بیشتر مورد استفاده قرار می گیرد را انتخاب کنید)
پیشنهاد: همانطور که می دانیم، تصفیه و دفع دو استراتژی مکمل هستند و نباید به تنهایی مدنظر قرار گیرند. پس از تصفیه پسماندهای عفونی، استفاده از استراتژی دفع اجتناب ناپذیر است. استثنا، طبق نظر  WHO  مدیریت ایمن زباله های ناشی از فعالیت های مراقبت های بهداشتی)، دفن زباله ایمن (دفن زباله های بهداشتی محصور شده یا بی فعالیت) می تواند به عنوان یک اقدام تصفیه/دفع مورد استفاده قرار گیرد.
',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'اتوکلاو + دفن بهداشتی',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'سوزاندن (دو محفظه ای ، زباله سوز 850-1000 درجه سانتی گراد)',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'سوزاندن (سایر روش ها)',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سوزاندن در گودال محافظت شده',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'تحت تصفیه و بی خطرسازی قرار نگرفته ، اما در گودالل های محافظت شده دفن شده است.',
                    ],
                    [
                        'key'   => 6,
                        'value' => 'تصفیه و بی خطرسازی نمی شود ، اما برای دفع به محل های دفع زباله های پزشکی خارج از مرکز، جمع آوری می شود.',
                    ],
                    [
                        'key'   => 7,
                        'value' => 'تخلیه باز بدون تصفیه و بی خطرسازی',
                    ],
                    [
                        'key'   => 8,
                        'value' => 'سوزاندن باز',
                    ],
                    [
                        'key'   => 9,
                        'value' => 'تصفیه نشده و به ضایعات عمومی اضافه می شود.',
                    ],
                    [
                        'key'   => 10,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 3,
                'section'      => 5,
                'badge'        => 'G-WM3',
                'title'        => 'این مرکز معمولاً چگونه زباله های تیز و برنده را دفع می کند؟ ',
                'descriptions' => '(توجه: روشی که بیشتر مورد استفاده قرار می گیرد را انتخاب کنید)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'اتوکلاو + دفن بهداشتی',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'سوزاندن (دو محفظه ای ، زباله سوز 850-1000 درجه سانتی گراد)',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'سوزاندن (سایر روش ها)',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سوزاندن در گودال محافظت شده',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'تحت تصفیه و بی خطرسازی قرار نگرفته ، اما در گودالل های محافظت شده دفن شده است.',
                    ],
                    [
                        'key'   => 6,
                        'value' => 'تصفیه و بی خطرسازی نمی شود ، اما برای دفع به محل های دفع زباله های پزشکی خارج از مرکز، جمع آوری می شود.',
                    ],
                    [
                        'key'   => 7,
                        'value' => 'تخلیه باز بدون تصفیه و بی خطرسازی',
                    ],
                    [
                        'key'   => 8,
                        'value' => 'سوزاندن باز',
                    ],
                    [
                        'key'   => 9,
                        'value' => 'تصفیه نشده و به ضایعات عمومی اضافه می شود.',
                    ],
                    [
                        'key'   => 10,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 4,
                'section'      => 5,
                'badge'        => 'G-WM4',
                'title'        => 'آیا شخصی (منصوب و آموزش دیده) مسئول مدیریت پسماندهای مراقبت های بهداشتی در مرکز مراقبت های بهداشتی است؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'تعیین شده اما آموزش ندیده است.',
                    ],
                    [
                        'key'   => 3,
                        'value' => ' منصوب نشده است.',
                    ],
                ],
            ],
            [
                'order'        => 5,
                'section'      => 5,
                'badge'        => 'G-WM5',
                'title'        => 'آیا پسماندهای مراقبت های بهداشتی در یک منطقه امن ذخیره می شوند و دسترسی فقط به پرسنل مجاز محدود می شود؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 6,
                'section'      => 5,
                'badge'        => 'G-WM6',
                'title'        => 'آیا این مرکز دستورالعمل/ روش های استاندارد عملیاتی (SOP) در زمینه مدیریت پسماند مراقبت های بهداشتی دارد؟ ',
                'descriptions' => '(توجه: اگر بله ، بپرسید: آیا می توانم دستورالعمل ها را ببینم؟)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله مشاهده شد',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'بله ، گزارش شده ، دیده نشده است',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'خیر',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'نمی دانم',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 7,
                'section'      => 5,
                'badge'        => 'G-WM7',
                'title'        => 'آیا دستورالعمل ها/روش های استاندارد عملیاتی (SOP) برای مدیریت پسماند مراقبت های بهداشتی ، ارسال شده است؟ ',
                'descriptions' => '(توجه: در صورت لزوم علامت گذاری کنید ، اگر دستورالعمل روی دیوار نصب شده باشد ، پرسشگر مشاهده کند)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله ، در تمام نقاط تولید زباله (به عنوان مثال ، OR ، ER ، کلینیک های سرپایی و غیره)',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'بله ، در محل نگهداری زباله های بهداشتی',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'خیر',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 8,
                'section'      => 5,
                'badge'        => 'G-WM8',
                'title'        => 'آیا ارائه دهندگان مراقبت های بهداشتی (مانند پزشکان ، پرستاران ، ماماها و غیره) در زمینه پروتکل های مدیریت ایمن پسماندهای مراقبت های بهداشتی آموزش دیده اند؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله ، همه ارائه دهندگان مراقبت های بهداشتی',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'بله ، اما فقط برخی از ارائه دهندگان مراقبت های بهداشتی',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'نه ، هیچ کس آموزش دیده نیست',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 9,
                'section'      => 5,
                'badge'        => 'G-WM9',
                'title'        => 'آیا جمع آوری کنندگان زباله مراقبت های بهداشتی در مورد خطرات ناشی از حمل نامناسب پسماندها آموزش دیده اند؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'نمی دانم',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 10,
                'section'      => 5,
                'badge'        => 'G-WM10',
                'title'        => 'آیا متصدیان پسماند مراقبت های بهداشتی در زمینه رسیدگی ایمن به زباله های مراقبت های بهداشتی (به عنوان مثال (SOP آموزش دیده اند؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'نمی دانم',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 11,
                'section'      => 5,
                'badge'        => 'G-WM11',
                'title'        => 'آیا همه کسانی که پسماند را جمع آوری می کنند در زمان بازرسی از PPE  (تجهیزات حفاظت فردی)  مناسب برخوردار هستند؟ ',
                'descriptions' => '(توجه: اگر شمارش كنندگان زباله از وسایل حفاظت شخصی استفاده كنند ، شمارش كننده باید توجه كند)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'نمی دانم',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'سایر ',
                    ],
                ],
            ],
            [
                'order'        => 1,
                'section'      => 6,
                'badge'        => 'G-C1',
                'title'        => 'آیا پروتکل ها/روش های استاندارد عملکرد(SOP)/دستورالعمل ها/راهنماها در زمینه نظافت محیطی موجود است؟',
                'descriptions' => 'پروتکل ها ممکن است نوشتاری یا غیر نوشتاری باشند چرا که برخی از نظافتچیان ممکن است سواد نداشته باشند. پروتکل ها باید شامل موارد زیر باشند:
•	تکنیک های گام به گام برای کارهای خاص ، مانند تمیز کردن کف ، تمیز کردن سینک ، تمیز کردن نشت خون یا مایعات بدن 
•	فهرست نظافت یا برنامه ای که مسئولیت و وظایف نظافت و دفعات انجام آنها را مشخص می کند.
•	پروتکل ها باید توسط سرشمار ملاحظه شود)
',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 2,
                'section'      => 6,
                'badge'        => 'G-C2',
                'title'        => 'آیا همه کارکنان مسئول نظافت آموزش دیده اند؟ ',
                'descriptions' => '(توجه: کارکنان مسئول نظافت: به ارائه دهندگان مراقبت های غیر بهداشتی مانند نظافتچی ها ، نظم دهندگان یا کارکنان کمکی و همچنین ارائه دهندگان مراقبت های بهداشتی که علاوه بر وظایف بالینی و مراقبت از بیمار ، وظایف نظافت را به عنوان بخشی از وظایف خود انجام می دهند ، اشاره دارد. آموزش به برنامه ها یا برنامه های آموزشی سازمان یافته ای گفته می شود که توسط مربی یا سرپرست واجد شرایط مناسب هدایت می شود)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله ، همه آموزش دیده اند',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر ، برخی نه همه آنها آموزش دیده اند',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'خیر ، هیچ کدام آموزش ندیده اند',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'خیر ، هیچ کارمندی مسئول نظافت نیست',
                    ],
                ],
            ],
            [
                'order'        => 3,
                'section'      => 6,
                'badge'        => 'G-C3',
                'title'        => 'آیا مواد تمیز کننده در زمان بررسی (مانند مواد شوینده و سایر محصولات تمیز کننده) موجود است؟ ',
                'descriptions' => '(توجه: محصولات نظافتی باید توسط پرسشگر ملاحظه شود)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 4,
                'section'      => 6,
                'badge'        => 'G-C4',
                'title'        => 'آیا کف ، سطوح و سرویس های بهداشتی مرکز مراقبت های بهداشتی در زمان تکمیل پرسشنامه تمیز است؟ ',
                'descriptions' => '(توجه: پرسشگر باید تمیزی کف ، سطوح و توالت را ملاحظه نماید)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'بله',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'خیر',
                    ],
                ],
            ],
            [
                'order'        => 1,
                'section'      => 7,
                'badge'        => 'G-E1',
                'title'        => 'منبع اصلی تامین برق چیست؟ ',
                'descriptions' => '(توجه: اگر پاسخ برای خدمات سرپایی متفاوت است ، برای خدمات بستری پاسخ دهید)',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'منبع مرکزی برق (به عنوان مثال ، شبکه ملی یا محلی) + ژنراتور پشتیبان',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'منبع مرکزی برق (به عنوان مثال ، شبکه ملی یا محلی)',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'ژنراتور (ژنراتور با سوخت یا باتری)',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'انرژی خورشیدی',
                    ],
                    [
                        'key'   => 5,
                        'value' => 'سایر',
                    ],
                ],
            ],
            [
                'order'        => 2,
                'section'      => 7,
                'badge'        => 'G-E2',
                'title'        => 'آیا در 7 روز گذشته ،  برق از منبع اصلی یا هر منبع پشتیبان دیگر در همه زمان ها برای ارائه خدمات در دسترس بوده است؟',
                'descriptions' => '',
                'options'      => [
                    [
                        'key'   => 1,
                        'value' => 'همیشه در دسترس (بدون وقفه)',
                    ],
                    [
                        'key'   => 2,
                        'value' => 'اغلب در دسترس است (برخی وقفه ها کمتر از 2 ساعت در روز)',
                    ],
                    [
                        'key'   => 3,
                        'value' => 'گاهی اوقات در دسترس است (وقفه های مکرر یا طولانی مدت بیش از 2 ساعت در روز)',
                    ],
                    [
                        'key'   => 4,
                        'value' => 'سایر ',
                    ],
                ],
            ],
        ];

        foreach ($questions as $question) {
            $questionInstance = $this->repository->create([
                'order'        => $question['order'],
                'section'      => $question['section'],
                'badge'        => $question['badge'],
                'title'        => $question['title'],
                'descriptions' => $question['descriptions'],
            ]);
            foreach ($question['options'] as $option) {
                QuestionOptions::query()->create([
                    'question_id' => $questionInstance->id,
                    'key'         => $option['key'],
                    'value'       => $option['value'],
                ]);
            }
        }
    }
}
